module.exports = {
    //[NICKNAME] - Для использование ника в тексте Start. (Вызов при /start или "Главная')
    Start: `Главное меню`,

    //Разные другие ошибки, не поддерживают ввод названий Ошибки
    Couldnt_Find_Error: `Мы не смогли обнаружить у вас дейстующих запросов.`,
    WrongReferalCode_Error: `Такой реферальный код не существует.`,

    File_error: 'Произошла ошибка, возможная проблема - неточный фомрат файла.',

    //Главный текст для обработки общих ошибок
    //[ERROR] - Для использования названия ошибки в тексте Ошибки
    //[NICKNAME] - Для использования ника администратора для тех поддержки в тексте
    Error: `Произошла ошибка. Сообщите Администрации!`,

    //Текст idi naxuy mne len pisat blyat
    Sort_Choose: "Отправьте все ваши логи и нажмите \"Готово\". (ВСЕ АРХИВЫ В ОДИН АРХИВ)",

    //Текст idi naxuy mne len pisat blyat
    Password_Choose: "Отправьте все ваши логи и нажмите \"Готово\". (ВСЕ АРХИВЫ В ОДИН АРХИВ)",
    
    //Текст выбора регионов 
    Choosing_Text: "Напишите какие регионы сортировать. Пример Сообщения: \"RU KZ IN\" (Добавьте в список Unknown для неопределенных логов)",

    //Tjsandmlasd,sa'
    URL_Text: `Напишите URL для поиска. (без http/https: Пример: \"google.com\")`,

    //Текст Для какой то хуйни, не помню уже 
    Sending_Text: "Файл готов: Размер [SIZE], Отправляю через [WAY]",
    
    //Текст когда начинается обработка
    Started_Text: "Идет обработка, это займет 1-10 минут. Зависит от количества файлов",

    //Текст когда начинается обработка
    Waiting_Text: "У вас все еще активная обработка, просим подождать!",

    //Текст Кнопки для возврата в начальное менью
    Return_Button: "Назад",

    //Текст Кнопки для Перехода в выбор регионов
    Ready_Button: "Готово",

    //Текст Начальной кнопки 
    Sort_Button: "Сортировать Логи",

    //Текст Начальной кнопки
    Passwords_Button: "Поиск Паролей",

    //Текст Кнопки для Админ Меню
    Admin_Button: `Админ Меню`,

    //Текст Кнопки для выбора F.A.Q. (Часто задаваемые вопросы) в начальном менью
    FAQ_Button: `F.A.Q ❓`,

    Help_Button: `Помощь`,

    //[NICKNAME] - Для использования ника администратора в тексте Тех поддержки
    Help: `Тех поддержка - [NICKNAME]`,

    //[NICKNAME] - Для использования ника администратора в тексте FAQ
    FAQ: `Дописать`,

    FolderMethod_Text: `Выберите как хотите чтоб сортировалось`,

    Folder_Button1:`Все в один`,

    Folder_Button2:`Каждый в свой язык`,
}